# TableCellStyle Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TableCellStyle Constructor
TableCellStyle Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TableCellStyle()()()() | Constructs a new TableCellStyle with default settings. |
| TableCellStyle(TableCellStyle) | Constructs a new copy of the input TableCellStyle object. |

# See Also
TableCellStyle Class
TableCellStyle Members
Autodesk.Revit.DB Namespace